app/Controllers/AuthController.php

SELECT *
FROM `operator`
WHERE `username` = 'ren'
AND `deleted_at` IS NULL
AND `operator`.`deleted_at` IS NULL
 LIMIT 1
---
    public function loginProcess()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->operator
                    ->where('username', $username)
                    ->where('deleted_at', null) // ⬅ CEK SOFT DELETE
                    ->first();