app/Controllers/OperatorController.php

SELECT *
FROM `operator`
WHERE `deleted_at` IS NULL
AND `operator`.`deleted_at` IS NULL
---
    public function operators()
    {
        $data['operators'] = $this->operator
            ->where('deleted_at', null)
            ->findAll();

INSERT INTO `operator` (`username`, `nama_lengkap`, `password`, `role`, `status`, `created_at`, `deleted_at`) VALUES ('kirisaki', 'kirisaki', '$2y$10$N4KaXQYMp1QqoZZ0xMQJhOO1esxKDRZN3Gnatrno3EtCEl5QeAU3G', 'operator', 'aktif', '2025-12-04 08:49:17', NULL)
---
    public function create()
    {
        // Jika membuat admin baru → password wajib
        if ($this->request->getPost('role') === 'admin' && empty($this->request->getPost('password'))) {
            return redirect()->back()->with('error', 'Password wajib untuk membuat akun admin.');
        }

        $this->operator->insert([
            'username'      => $this->request->getPost('username'),
            'nama_lengkap'  => $this->request->getPost('nama_lengkap'),
            'password'      => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'          => $this->request->getPost('role'),
            'status'        => 'aktif',
            'created_at'    => date('Y-m-d H:i:s'),
            'deleted_at'    => null
        ]);